app/Http/Controllers/AdminController.php

select * from `introduction`
---
    public function dashboard()
    {
        $signins = DB::table('introduction')->get();

select * from `users` where `AzureID` = 'e72ea6f6-4b63-4d87-899a-f410896646ee' limit 1
---
    public static function authorizeUser($userid): int
    {
        if($userid != null) {
            $groups = AzureUser::where('AzureID', $userid)->first();