app/Http/Controllers/MolliePaymentController.php

    private static function preparePayment($productIndex)
    {
        $product = Product::where('index', $productIndex)->first();
---
select * from `products` where `index` = 1 limit 1