app/Http/Controllers/myAccountController.php

select * from `users` where `AzureID` = 'e72ea6f6-4b63-4d87-899a-f410896646ee' limit 1
---
    public function index() {
        //Session::get('user');
        $userObject = User::where('AzureID', session('id'))->first();